#### Q-1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

In [2]:
import mysql.connector as db

In [3]:
mydb = db.connect(host = 'localhost', user = 'root', passwd = 'Manishaqwerm1106')

In [4]:
cursor = mydb.cursor()

In [5]:
cursor.execute("SHOW DATABASES")

In [6]:
cursor.fetchall()

[('employee',),
 ('information_schema',),
 ('mysql',),
 ('one_piece',),
 ('performance_schema',),
 ('sys',)]

In [7]:
cursor.execute("SELECT * FROM employee.customer_info")

In [8]:
cursor.fetchall()

[(1, 'ASHU', 'CHANDRA', 6000000, 'ashu@.com', 2001),
 (2, 'LUFFY', 'D', 60000, 'luffy@.com', 1999),
 (3, 'NAMI', 'BELLAMERE', 90000, 'nami@straw.com', 1999),
 (4, 'ZORO', 'RORONOA', 10000, 'bellamere@.com', 1991)]

In [9]:
cursor.execute("DESC employee.customer_info")

In [10]:
cursor.fetchall()

[('id', b'int', 'NO', 'PRI', None, ''),
 ('first_name', b'varchar(40)', 'NO', '', None, ''),
 ('last_name', b'varchar(40)', 'NO', '', None, ''),
 ('SALARY', b'int', 'YES', '', None, ''),
 ('email', b'varchar(30)', 'NO', '', None, ''),
 ('DOB', b'year', 'NO', '', None, '')]

In [11]:
 cursor.execute("USE employee")

In [12]:
cursor.execute("SELECT * FROM (SELECT first_name FROM customer_info WHERE id = 1) AS a")

In [13]:
cursor.fetchall()

[('ASHU',)]

In [14]:
cursor.execute("SELECT SUBSTRING('ASHU',1,3)")

In [15]:
cursor.fetchall()

[('ASH',)]

#### Q-2. Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [25]:
cursor.execute("SELECT * FROM customer_info")

In [26]:
cursor.fetchall()

[(1, 'Amitabh', 'CHANDRA', 6000000, 'ashu@.com', 2001),
 (2, 'LUFFY', 'D', 60000, 'luffy@.com', 1999),
 (3, 'NAMI', 'BELLAMERE', 90000, 'nami@straw.com', 1999),
 (4, 'ZORO', 'RORONOA', 10000, 'bellamere@.com', 1991)]

In [24]:
cursor.execute("UPDATE customer_info SET first_name = 'Amitabh' WHERE id = 1")

In [22]:
cursor.execute("SELECT * FROM (SELECT first_name FROM customer_info WHERE id = 1) as f_name")

In [23]:
cursor.fetchall()

[('AMITABH',)]

In [53]:
cursor.execute("SELECT LOCATE ('a' , 'Amitabh',2) AS first_pos")

In [54]:
cursor.fetchall()

[(5,)]

#### Q-3. Write an SQL query to print the name of employees having the highest salary in each department.

In [56]:
cursor.execute("ALTER TABLE customer_info ADD department VARCHAR(4) NOT NULL")

In [57]:
cursor.execute("UPDATE customer_info SET department = 'a' WHERE id = 1")

In [61]:
cursor.execute("UPDATE customer_info SET department = 'a' WHERE id = 2")

In [62]:
cursor.execute("UPDATE customer_info SET department = 'b' WHERE id = 3")

In [63]:
cursor.execute("UPDATE customer_info SET department = 'b' WHERE id = 4")

In [64]:
cursor.execute('SELECT * FROM customer_info')

In [65]:
cursor.fetchall()

[(1, 'Amitabh', 'CHANDRA', 6000000, 'ashu@.com', 2001, 'a'),
 (2, 'LUFFY', 'D', 60000, 'luffy@.com', 1999, 'a'),
 (3, 'NAMI', 'BELLAMERE', 90000, 'nami@straw.com', 1999, 'b'),
 (4, 'ZORO', 'RORONOA', 10000, 'bellamere@.com', 1991, 'b')]

In [68]:
cursor.execute("SELECT first_name,MAX(SALARY) FROM customer_info WHERE department = 'a' ")

In [69]:
cursor.fetchall()

[('Amitabh', 6000000)]

In [70]:
cursor.execute("SELECT first_name,MAX(SALARY) FROM customer_info WHERE department = 'b' ")

In [71]:
cursor.fetchall()

[('NAMI', 90000)]